app/Controllers/Login.php

SELECT *
FROM `usuario`
WHERE `email` = 'lucas.leoni@gmail.com'
 LIMIT 1
---
    public function store()
    {
        $email = $this->request->getPost('email');
        $senha = $this->request->getPost('senha');

        $usuario = new UsuarioModel();

        // Procura o usuario no bd
        $usuarioEncontrado = $usuario->where('email', $email)->first();

INSERT INTO `usuario` (`nome`, `email`, `senha`, `cargo`) VALUES ('Lucas Leoni', 'lucas@gmail.com', '123456', 1)
---
    public function registerStore()
    {
        $usuario = new UsuarioModel();

        $usuario->insert([
            'nome' => $this->request->getPost('nome'),
            'email' => $this->request->getPost('email'),
            'senha' => $this->request->getPost('senha'),
            'cargo' => 1
        ]);