app/Controllers/Produto.php

SELECT *
FROM `produtos`
---
    public function readProduct()
    {
        // Se o usuario estiver logado, ele pode entrar, caso contrario redirecionar para a tela de login
        if (!session()->has('usuario')) {
            return redirect()->route('login');
        }

        $produtos = new ProdutoModel();

        $listaDeProdutos = $produtos->findAll();

INSERT INTO `produtos` (`prod_nome`, `prod_preco`, `prod_marca`, `prod_quantidade`) VALUES ('Poco X5 Pro', '1700', 'Xiaomi', '10')
---
    public function addProduct() {
        // Se o usuario estiver logado, ele pode entrar, caso contrario redirecionar para a tela de login
        if (!session()->has('usuario')) {
            return redirect()->route('login');
        }

        $produtos = new ProdutoModel();

        $produtos->insert([
            'prod_nome' => $this->request->getPost('nome'),
            'prod_preco' => $this->request->getPost('preco'),
            'prod_marca' => $this->request->getPost('marca'),
            'prod_quantidade' => $this->request->getPost('quantidade')
        ]);