app/Controllers/Usuario.php

SELECT *
FROM `usuario`
---
    public function readUser()
    {
        // Se o usuario estiver logado, ele pode entrar, caso contrario redirecionar para a tela de login
        if (!session()->has('usuario')) {
            return redirect()->route('login');
        }

        $usuario = new UsuarioModel();

        $listaDeUsuario = $usuario->findAll();